chipKIT32/chipKIT-core/pic32/boards.txt
# new items
quick240_usb_pic32.platform=pic32
quick240_usb_pic32.build.board=_BOARD_PONTECH_QUICK240_USB_
quick240_usb_pic32.ldscript=chipKIT-application-32MX795F512.ld
# end of new items

quick240_usb_pic32.usb.enabled=true
quick240_usb_pic32.usb.default=a_cdcacm

quick240_usb_pic32.upload.protocol=stk500v2
quick240_usb_pic32.upload.maximum_size=520192
quick240_usb_pic32.upload.maximum_data_size=131072
quick240_usb_pic32.upload.speed=115200
quick240_usb_pic32.upload.tool=pic32prog

quick240_usb_pic32.build.mcu=32MX795F512L
quick240_usb_pic32.build.f_cpu=80000000L
quick240_usb_pic32.build.core=pic32
quick240_usb_pic32.build.variant=PONTECH_Quick240

usbono_pic32.name=PONTECH UAV100
usbono_pic32.group=PONTECH

# new items
usbono_pic32.platform=pic32
usbono_pic32.build.board=_BOARD_PONTECH_UAV100_

usbono_pic32.usb.enabled=true
usbono_pic32.usb.default=a_cdcacm

usbono_pic32.ldscript=chipKIT-application-32MX440F512.ld
# Use this -G1024 option ONLY for boards with 64K RAM or less
usbono_pic32.compiler.c.extra_flags=-G1024 -Danything=1
usbono_pic32.compiler.cpp.extra_flags=-G1024 -Danything=1
#chipKIT-UNO32-application-32MX320F128L.ld
# end of new items

usbono_pic32.upload.protocol=stk500v2
usbono_pic32.upload.maximum_size=520192
usbono_pic32.upload.maximum_data_size=32768
usbono_pic32.upload.speed=115200
usbono_pic32.upload.tool=pic32prog

usbono_pic32.build.mcu=32MX440F512H
usbono_pic32.build.f_cpu=80000000L
usbono_pic32.build.core=pic32
usbono_pic32.build.variant=PONTECH_UAV100
#usbono_pic32.build.variant=Uno32

dsmini.name=DataStation Mini
dsmini.group=Makerology
dsmini.platform=pic32
dsmini.build.board=_BOARD_DSMINI_
dsmini.ccflags=-Map="map.map"
dsmini.ldscript=chipKIT-application-32MX150F128.ld
dsmini.build.ldscript.path={build.variant.path}

dsmini.usb.enabled=false

# Use this -G1024 option ONLY for boards with 64K RAM or less
dsmini.compiler.c.extra_flags=-G1024
dsmini.compiler.cpp.extra_flags=-G1024
dsmini.upload.protocol=stk500v2

# 128KB - 4K for EEPROM - 4K for bootloader
dsmini.upload.maximum_size=122880
dsmini.upload.speed=115200
dsmini.upload.tool=pic32prog

dsmini.build.mcu=32MX150F128C
dsmini.build.f_cpu=40000000L
dsmini.build.core=pic32
dsmini.build.variant=DSMini
RGB_Station.name=RGB Station
RGB_Station.group=chipKIT

RGB_Station.platform=pic32
RGB_Station.build.board=_BOARD_RGB_STATION_

RGB_Station.usb.enabled=true
RGB_Station.usb.default=a_cdcacm

RGB_Station.ccflags=-Map="map.map"
RGB_Station.ldscript=chipKIT-application-32MX270F256_BLEBootloader.ld
# Use this -G1024 option ONLY for boards with 64K RAM or less
RGB_Station.compiler.c.extra_flags=-G1024
RGB_Station.compiler.cpp.extra_flags=-G1024
RGB_Station.build.ldscript.path={build.variant.path}

RGB_Station.upload.protocol=stk500v2
# 256KB (0x40000) - 4K (0x1000) for exception vectors - 4K (0x1000) for EEPROM - 12K (0x3000) for bootloader = (245760) 0x3B000
# This number isn't exactly correct yet - you can't get to 100% without problems. But it's close.
RGB_Station.upload.maximum_size=245760
# 64KB (0x10000) - 2048 (0x800) for stack - 344 (0x158) for something else = 63488 (0xF800)
# This number isn't exactly correct yet - you can't get to 100% without problems. But it's close.
RGB_Station.upload.maximum_data_size=63488
RGB_Station.upload.speed=115200
RGB_Station.upload.tool=pic32prog

RGB_Station.build.mcu=32MX270F256D
RGB_Station.build.f_cpu=48000000L
RGB_Station.build.core=pic32
RGB_Station.build.variant=RGB_Station

RGB_Station.menu.Frequency.48=48MHz
RGB_Station.menu.Frequency.build.f_cpu=48000000L


############# Auto generated menu entries below here. ###############
############### DO NOT ADD ANYTHING AFTER THIS LINE #################

OpenScope.menu.USB.a_cdcacm=Serial
OpenScope.menu.USB.a_cdcacm.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM__ -D__SERIAL_IS_USB__
OpenScope.menu.USB.b_cdcacm_km=Serial, Keyboard & Mouse
OpenScope.menu.USB.b_cdcacm_km.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM_KM__ -D__SERIAL_IS_USB__
OpenScope.menu.USB.z_custom=Custom / Disabled
OpenScope.menu.USB.z_custom.build.extra_flags=

lenny.menu.USB.b_cdcacm_km=Serial, Keyboard & Mouse
lenny.menu.USB.b_cdcacm_km.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM_KM__ -D__SERIAL_IS_USB__
lenny.menu.USB.a_cdcacm=Serial
lenny.menu.USB.a_cdcacm.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM__ -D__SERIAL_IS_USB__
lenny.menu.USB.z_custom=Custom / Disabled
lenny.menu.USB.z_custom.build.extra_flags=

mega_pic32.menu.USB.z_custom=Custom / Disabled
mega_pic32.menu.USB.z_custom.build.extra_flags=
mega_pic32.menu.USB.a_cdcacm=Serial
mega_pic32.menu.USB.a_cdcacm.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM__ -D__SERIAL_IS_USB__
mega_pic32.menu.USB.b_cdcacm_km=Serial, Keyboard & Mouse
mega_pic32.menu.USB.b_cdcacm_km.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM_KM__ -D__SERIAL_IS_USB__

picadillo_35t.menu.USB.z_custom=Custom / Disabled
picadillo_35t.menu.USB.z_custom.build.extra_flags=
picadillo_35t.menu.USB.a_cdcacm=Serial
picadillo_35t.menu.USB.a_cdcacm.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM__ -D__SERIAL_IS_USB__
picadillo_35t.menu.USB.b_cdcacm_km=Serial, Keyboard & Mouse
picadillo_35t.menu.USB.b_cdcacm_km.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM_KM__ -D__SERIAL_IS_USB__

ubw32_mx795.menu.USB.a_cdcacm=Serial
ubw32_mx795.menu.USB.a_cdcacm.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM__ -D__SERIAL_IS_USB__
ubw32_mx795.menu.USB.b_cdcacm_km=Serial, Keyboard & Mouse
ubw32_mx795.menu.USB.b_cdcacm_km.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM_KM__ -D__SERIAL_IS_USB__
ubw32_mx795.menu.USB.z_custom=Custom / Disabled
ubw32_mx795.menu.USB.z_custom.build.extra_flags=

quick240_usb_pic32.menu.USB.a_cdcacm=Serial
quick240_usb_pic32.menu.USB.a_cdcacm.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM__ -D__SERIAL_IS_USB__
quick240_usb_pic32.menu.USB.b_cdcacm_km=Serial, Keyboard & Mouse
quick240_usb_pic32.menu.USB.b_cdcacm_km.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM_KM__ -D__SERIAL_IS_USB__
quick240_usb_pic32.menu.USB.z_custom=Custom / Disabled
quick240_usb_pic32.menu.USB.z_custom.build.extra_flags=

pontech_NoFire.menu.USB.a_cdcacm=Serial
pontech_NoFire.menu.USB.a_cdcacm.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM__ -D__SERIAL_IS_USB__
pontech_NoFire.menu.USB.b_cdcacm_km=Serial, Keyboard & Mouse
pontech_NoFire.menu.USB.b_cdcacm_km.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM_KM__ -D__SERIAL_IS_USB__
pontech_NoFire.menu.USB.z_custom=Custom / Disabled
pontech_NoFire.menu.USB.z_custom.build.extra_flags=

RGB_Station.menu.USB.a_cdcacm=Serial
RGB_Station.menu.USB.a_cdcacm.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM__ -D__SERIAL_IS_USB__
RGB_Station.menu.USB.b_cdcacm_km=Serial, Keyboard & Mouse
RGB_Station.menu.USB.b_cdcacm_km.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM_KM__ -D__SERIAL_IS_USB__
RGB_Station.menu.USB.z_custom=Custom / Disabled
RGB_Station.menu.USB.z_custom.build.extra_flags=

ubw32_mx460.menu.USB.a_cdcacm=Serial
ubw32_mx460.menu.USB.a_cdcacm.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM__ -D__SERIAL_IS_USB__
ubw32_mx460.menu.USB.b_cdcacm_km=Serial, Keyboard & Mouse
ubw32_mx460.menu.USB.b_cdcacm_km.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM_KM__ -D__SERIAL_IS_USB__
ubw32_mx460.menu.USB.z_custom=Custom / Disabled
ubw32_mx460.menu.USB.z_custom.build.extra_flags=

clicker2.menu.USB.a_cdcacm=Serial
clicker2.menu.USB.a_cdcacm.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM__ -D__SERIAL_IS_USB__
clicker2.menu.USB.b_cdcacm_km=Serial, Keyboard & Mouse
clicker2.menu.USB.b_cdcacm_km.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM_KM__ -D__SERIAL_IS_USB__
clicker2.menu.USB.z_custom=Custom / Disabled
clicker2.menu.USB.z_custom.build.extra_flags=

flipnclickmz.menu.USB.a_cdcacm=Serial
flipnclickmz.menu.USB.a_cdcacm.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM__ -D__SERIAL_IS_USB__
flipnclickmz.menu.USB.b_cdcacm_km=Serial, Keyboard & Mouse
flipnclickmz.menu.USB.b_cdcacm_km.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM_KM__ -D__SERIAL_IS_USB__
flipnclickmz.menu.USB.z_custom=Custom / Disabled
flipnclickmz.menu.USB.z_custom.build.extra_flags=

chipkit_Pi.menu.USB.z_custom=Custom / Disabled
chipkit_Pi.menu.USB.z_custom.build.extra_flags=
chipkit_Pi.menu.USB.a_cdcacm=Serial
chipkit_Pi.menu.USB.a_cdcacm.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM__ -D__SERIAL_IS_USB__
chipkit_Pi.menu.USB.b_cdcacm_km=Serial, Keyboard & Mouse
chipkit_Pi.menu.USB.b_cdcacm_km.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM_KM__ -D__SERIAL_IS_USB__

Olimex_Pinguino32.menu.USB.a_cdcacm=Serial
Olimex_Pinguino32.menu.USB.a_cdcacm.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM__ -D__SERIAL_IS_USB__
Olimex_Pinguino32.menu.USB.b_cdcacm_km=Serial, Keyboard & Mouse
Olimex_Pinguino32.menu.USB.b_cdcacm_km.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM_KM__ -D__SERIAL_IS_USB__
Olimex_Pinguino32.menu.USB.z_custom=Custom / Disabled
Olimex_Pinguino32.menu.USB.z_custom.build.extra_flags=

chipkit_WF32.menu.USB.z_custom=Custom / Disabled
chipkit_WF32.menu.USB.z_custom.build.extra_flags=
chipkit_WF32.menu.USB.a_cdcacm=Serial
chipkit_WF32.menu.USB.a_cdcacm.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM__ -D__SERIAL_IS_USB__
chipkit_WF32.menu.USB.b_cdcacm_km=Serial, Keyboard & Mouse
chipkit_WF32.menu.USB.b_cdcacm_km.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM_KM__ -D__SERIAL_IS_USB__

