chipKIT32/chipKIT-core/pic32/boards.txt
CUI32stem.menu.USB.a_cdcacm=Serial
CUI32stem.menu.USB.a_cdcacm.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM__ -D__SERIAL_IS_USB__
CUI32stem.menu.USB.b_cdcacm_km=Serial, Keyboard & Mouse
CUI32stem.menu.USB.b_cdcacm_km.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM_KM__ -D__SERIAL_IS_USB__
CUI32stem.menu.USB.z_custom=Custom / Disabled
CUI32stem.menu.USB.z_custom.build.extra_flags=

usbono_pic32.menu.USB.a_cdcacm=Serial
usbono_pic32.menu.USB.a_cdcacm.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM__ -D__SERIAL_IS_USB__
usbono_pic32.menu.USB.b_cdcacm_km=Serial, Keyboard & Mouse
usbono_pic32.menu.USB.b_cdcacm_km.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM_KM__ -D__SERIAL_IS_USB__
usbono_pic32.menu.USB.z_custom=Custom / Disabled
usbono_pic32.menu.USB.z_custom.build.extra_flags=

fubarino_sd.menu.USB.a_cdcacm=Serial
fubarino_sd.menu.USB.a_cdcacm.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM__ -D__SERIAL_IS_USB__
fubarino_sd.menu.USB.b_cdcacm_km=Serial, Keyboard & Mouse
fubarino_sd.menu.USB.b_cdcacm_km.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM_KM__ -D__SERIAL_IS_USB__
fubarino_sd.menu.USB.z_custom=Custom / Disabled
fubarino_sd.menu.USB.z_custom.build.extra_flags=

chipkit_pro_mx7.menu.USB.z_custom=Custom / Disabled
chipkit_pro_mx7.menu.USB.z_custom.build.extra_flags=
chipkit_pro_mx7.menu.USB.a_cdcacm=Serial
chipkit_pro_mx7.menu.USB.a_cdcacm.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM__ -D__SERIAL_IS_USB__
chipkit_pro_mx7.menu.USB.b_cdcacm_km=Serial, Keyboard & Mouse
chipkit_pro_mx7.menu.USB.b_cdcacm_km.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM_KM__ -D__SERIAL_IS_USB__

cui32.menu.USB.a_cdcacm=Serial
cui32.menu.USB.a_cdcacm.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM__ -D__SERIAL_IS_USB__
cui32.menu.USB.b_cdcacm_km=Serial, Keyboard & Mouse
cui32.menu.USB.b_cdcacm_km.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM_KM__ -D__SERIAL_IS_USB__
cui32.menu.USB.z_custom=Custom / Disabled
cui32.menu.USB.z_custom.build.extra_flags=

chipkit_DP32.menu.USB.a_cdcacm=Serial
chipkit_DP32.menu.USB.a_cdcacm.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM__ -D__SERIAL_IS_USB__
chipkit_DP32.menu.USB.b_cdcacm_km=Serial, Keyboard & Mouse
chipkit_DP32.menu.USB.b_cdcacm_km.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM_KM__ -D__SERIAL_IS_USB__
chipkit_DP32.menu.USB.z_custom=Custom / Disabled
chipkit_DP32.menu.USB.z_custom.build.extra_flags=

chipkit_WiFire.menu.USB.z_custom=Custom / Disabled
chipkit_WiFire.menu.USB.z_custom.build.extra_flags=
chipkit_WiFire.menu.USB.a_cdcacm=Serial
chipkit_WiFire.menu.USB.a_cdcacm.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM__ -D__SERIAL_IS_USB__
chipkit_WiFire.menu.USB.b_cdcacm_km=Serial, Keyboard & Mouse
chipkit_WiFire.menu.USB.b_cdcacm_km.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM_KM__ -D__SERIAL_IS_USB__

fubarino_mini.menu.USB.a_cdcacm=Serial
fubarino_mini.menu.USB.a_cdcacm.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM__ -D__SERIAL_IS_USB__
fubarino_mini.menu.USB.b_cdcacm_km=Serial, Keyboard & Mouse
fubarino_mini.menu.USB.b_cdcacm_km.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM_KM__ -D__SERIAL_IS_USB__
fubarino_mini.menu.USB.z_custom=Custom / Disabled
fubarino_mini.menu.USB.z_custom.build.extra_flags=

